org-files/pagescreencasts.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
#+Title: Screencasts for Seminar Datascience for Economics
#+Author: Jan Boone
#+OPTIONS: toc:2 timestamp:nil toc:nil

*Under construction*


This page contains the screencasts for the first part of the course [[./index.org][Seminar Datascience for Economics]].

#+TOC: headlines 2

* How are the screencasts supposed to help?
  :PROPERTIES:
  :ID:       how_are_screencasts_supposed_to_help_datascience
  :END:

For the first part of the course we use [[https://github.com/janboone/msc_datascience/blob/master/Statistical_Hacking.ipynb][this notebook]]. The notebook is fairly self-explanatory, but you may get stuck with some of the questions. The screencasts are meant to help you along if you do not know how to proceed. The idea is similar to what we did in [[https://janboone.github.io/applied-economics/index.html][Applied Economic Analysis]].

** Why are there screencasts?

The screencasts are used as complements to the lecturers and classes taught. For some programming problems you need to take time to try to solve them yourself. This we cannot do in class as some students solve them quickly (and get bored) while others need more time to solve these by themselves. 

** Suggested use of the screencasts

Just watching the screencasts is not going to be very useful for you. The best way to use them is as follows:

+ first read the relevant section in the notebook and try to solve the questions by yourself
+ if you manage to do so, you are done and there is no need to watch the screencast; if you do not manage to answer all the questions, you have the background for the screencast (which is rather short and does not motivate the underlying economic problem) and you know what problems to look for in the video
+ type along with what we do in the screencast. Pause the video if you need more time to type
+ experiment with the code that we give you in the video either during the video or after watching it; try different numerical values, use different syntax or a different library; if you get an error, google it to see what is going on etc.
+ in general, play around with the python code; that is the best way to understand and learn the language

With screencasts there is --obviously-- no interaction between teachers and students. This is a problem when you run into an error message. In class students then immediately raise their hand to understand what is happening.

As this is not possible with a screencast, here are some tips on how to deal with error messages. Also note that as the screencast is typed "live", so there will be error messages in the videos as well and you can see how we deal with these as we go along.

Python error messages:
+ start reading the error message at the end; hence scroll down in your notebook to see the last line of the error message. This will usually give a clue of what is happening
+ if you do not know what the last line means, use copy/paste to google it or go to [[https://stackoverflow.com/][stackoverflow]] directly
+ reading "upwards" from the last line, you can trace how the error was generated 

** Prerequisite knowledge

*Economics/Econometrics:* this introduction to datascience is part of an MSc degree in Economics. Hence, we assume that you know what OLS is, standard errors, the difference between correlation and causality and you have seen instrumental variables before. In terms of math, you can do some basic linear algebra like multiplying a matrix and a vector and know what a (partial) derivative of a function is.

*Python*: you have done [[https://janboone.github.io/applied-economics/index.html][Applied Economic Analysis]].

** Libraries we use

+ numpy: basic number crunching and vector manipulation
+ pandas to work with dataframes
+ statsmodels to do OLS
+ pymc3: to generate random numbers and do Bayesian analysis
+ tensorflow (2.0 or later): we use keras for our neural networks
+ scipy: scientific python
+ matplotlib: to make plots

* Compare jupyter notebook/lab and emacs

** Why am I using emacs

You know how to work with JupyterLab on the university servers (or on your own laptop). As with Applied Economic Analysis, most screencasts will be made with Emacs. See the [[https://janboone.github.io/applied-economics/pagescreencasts.html#org3bcecee][Applied Economics website]] for an explanation why I use Emacs.

* Distributions of an estimator

** distribution of sample average and standard deviation

*** generating data

[[yt:QLVO-twLJU4][generating data]]

Topics we cover in this video:
- some estimators have known (analytical) distributions
- this is usually not the case with advanced models in datascience
- hence we need to know how to simulate such distributions
- we first simulate the distribution of a sample average $m$
- we use the code =tf.random.uniform([N_simulations,sample_size],0,1)= to generate =N_simulations= times a sample of size =sample_size=
- this results in a dataset with =N_simulations= rows and =sample_size= columns
- =tf.random.uniform?= to see how this function can be used

Questions you should be able to answer before continuing:
-  generate data that is drawn from a normal distribution with mean 0 and standard deviation 1

