pagescreencasts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Screencasts for Seminar Datascience for Economics</title>
<meta name="author" content="Jan Boone" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Screencasts for Seminar Datascience for Economics</h1>
<p>
<b>Under construction</b>
</p>


<p>
This page contains the screencasts for the first part of the course <a href="./index.html">Seminar Datascience for Economics</a>.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgeb8e978">How are the screencasts supposed to help?</a>
<ul>
<li><a href="#orgf41b8c4">Why are there screencasts?</a></li>
<li><a href="#org290099c">Suggested use of the screencasts</a></li>
<li><a href="#org78a9de7">Prerequisite knowledge</a></li>
<li><a href="#org9f3fcea">Libraries we use</a></li>
</ul>
</li>
<li><a href="#org3581636">Compare jupyter notebook/lab and emacs</a>
<ul>
<li><a href="#orge7b20aa">Why am I using emacs</a></li>
</ul>
</li>
<li><a href="#org37e8e50">Distributions of an estimator</a>
<ul>
<li><a href="#org8254f5e">distribution of sample average and standard deviation</a></li>
<li><a href="#org7b9e2de">distribution of a slope</a></li>
<li><a href="#org4dd0178">bootstrapping</a></li>
<li><a href="#org2d56c80">Doing your own OLS and lasso regressions</a></li>
</ul>
</li>
<li><a href="#org4168865">Causality</a>
<ul>
<li><a href="#orga05121a">Fork</a></li>
<li><a href="#org6db5442">Pipe</a></li>
<li><a href="#org56e3357">Collider</a></li>
</ul>
</li>
<li><a href="#orgc194898">Tensors</a>
<ul>
<li><a href="#orgda5fdc3">Introduction</a></li>
<li><a href="#orgc9bbfc3">Creating tensors with numpy</a></li>
<li><a href="#orgd6f7d30">Broadcasting</a></li>
<li><a href="#orgd747396">slicing and fancy indexing</a></li>
<li><a href="#org8ad0fe2">First neural network</a></li>
</ul>
</li>
<li><a href="#org261e0ce">Overfitting and underfitting</a>
<ul>
<li><a href="#org9fba47a">generating the data</a></li>
<li><a href="#orgb72bc1b">overfitting</a></li>
</ul>
</li>
<li><a href="#org3e3951d">Neural network</a>
<ul>
<li><a href="#org8378d0c">perceptron</a></li>
<li><a href="#org4a47acc">tensorflow regression</a></li>
<li><a href="#org9cac2c0">tensorflow classification</a></li>
</ul>
</li>
<li><a href="#orgef90c27">Back to our first neural network</a>
<ul>
<li><a href="#org455a7fe">defining the network and fitting it</a></li>
<li><a href="#org4f88ebc">checking the fit</a></li>
<li><a href="#org3577a3b">number of epochs and overfitting</a></li>
</ul>
</li>
<li><a href="#orgef75b21">Treatment effects</a>
<ul>
<li><a href="#orgd39b2b0">IV</a></li>
<li><a href="#org2abf822">Heterogenous treatment effects</a></li>
<li><a href="#org0cafaf6">Probability of treatment</a></li>
</ul>
</li>
<li><a href="#org94ebb02">Part 2</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgeb8e978" class="outline-2">
<h2 id="orgeb8e978">How are the screencasts supposed to help?</h2>
<div class="outline-text-2" id="text-orgeb8e978">
<p>
For the first part of the course we use <a href="https://github.com/janboone/msc_datascience/blob/master/Statistical_Hacking.ipynb">this notebook</a>. The notebook is fairly self-explanatory, but you may get stuck with some of the questions. The screencasts are meant to help you along if you do not know how to proceed. The idea is similar to what we did in <a href="https://janboone.github.io/applied-economics/index.html">Applied Economic Analysis</a>.
</p>
</div>

<div id="outline-container-orgf41b8c4" class="outline-3">
<h3 id="orgf41b8c4">Why are there screencasts?</h3>
<div class="outline-text-3" id="text-orgf41b8c4">
<p>
The screencasts were initially developed because of the 2020 corona crisis where students were no longer able to come to the campus of Tilburg University. But they can also be used as complements to the lecturers and classes taught.
</p>
</div>
</div>

<div id="outline-container-org290099c" class="outline-3">
<h3 id="org290099c">Suggested use of the screencasts</h3>
<div class="outline-text-3" id="text-org290099c">
<p>
Just watching the screencasts is not going to be very useful for you. The best way to use them is as follows:
</p>

<ul class="org-ul">
<li>first read the relevant section in the notebook and try to solve the questions by yourself</li>
<li>if you manage to do so, you are done and there is no need to watch the screencast; if you do not manage to answer all the questions, you have the background for the screencast (which is rather short and does not motivate the underlying economic problem) and you know what problems to look for in the video</li>
<li>type along with what we do in the screencast. Pause the video if you need more time to type</li>
<li>experiment with the code that we give you in the video either during the video or after watching it; try different numerical values, use different syntax or a different library; if you get an error, google it to see what is going on etc.</li>
<li>in general, play around with the python code; that is the best way to understand and learn the language</li>
</ul>

<p>
With screencasts there is &#x2013;obviously&#x2013; no interaction between teachers and students. This is a problem when you run into an error message. In class students then immediately raise their hand to understand what is happening.
</p>

<p>
As this is not possible with a screencast, here are some tips on how to deal with error messages. Also note that as the screencast is typed "live", so there will be error messages in the videos as well and you can see how we deal with these as we go along.
</p>

<p>
Python error messages:
</p>
<ul class="org-ul">
<li>start reading the error message at the end; hence scroll down in your notebook to see the last line of the error message. This will usually give a clue of what is happening</li>
<li>if you do not know what the last line means, use copy/paste to google it or go to <a href="https://stackoverflow.com/">stackoverflow</a> directly</li>
<li>reading "upwards" from the last line, you can trace how the error was generated</li>
</ul>
</div>
</div>

<div id="outline-container-org78a9de7" class="outline-3">
<h3 id="org78a9de7">Prerequisite knowledge</h3>
<div class="outline-text-3" id="text-org78a9de7">
<p>
<b>Economics/Econometrics</b> this introduction to datascience is part of an MSc degree in Economics. Hence, we assume that you know what OLS is, standard errors, the difference between correlation and causality and you have seen instrumental variables before. In terms of math, you can do some basic linear algebra like multiplying a matrix and a vector and know what a (partial) derivative of a function is.
</p>

<p>
<b>Python</b>: you have done the python track of <a href="https://janboone.github.io/applied-economics/index.html">Applied Economic Analysis</a>.
</p>
</div>
</div>

<div id="outline-container-org9f3fcea" class="outline-3">
<h3 id="org9f3fcea">Libraries we use</h3>
<div class="outline-text-3" id="text-org9f3fcea">
<ul class="org-ul">
<li>numpy: basic number crunching and vector manipulation</li>
<li>pandas to work with dataframes</li>
<li>statsmodels to do OLS</li>
<li>pymc3: to generate random numbers and do Bayesian analysis</li>
<li>tensorflow (2.0 or later): we use keras for our neural networks</li>
<li>scipy: scientific python</li>
<li>matplotlib: to make plots</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3581636" class="outline-2">
<h2 id="org3581636">Compare jupyter notebook/lab and emacs</h2>
<div class="outline-text-2" id="text-org3581636">
</div>
<div id="outline-container-orge7b20aa" class="outline-3">
<h3 id="orge7b20aa">Why am I using emacs</h3>
<div class="outline-text-3" id="text-orge7b20aa">
<p>
You know how to work with JupyterLab on the university servers (or on your own laptop). As with Applied Economic Analysis, most screencasts will be made with Emacs. See the <a href="https://janboone.github.io/applied-economics/pagescreencasts.html#org3bcecee">Applied Economics website</a> for an explanation why I use Emacs.
</p>
</div>
</div>
</div>

<div id="outline-container-org37e8e50" class="outline-2">
<h2 id="org37e8e50">Distributions of an estimator</h2>
<div class="outline-text-2" id="text-org37e8e50">
</div>
<div id="outline-container-org8254f5e" class="outline-3">
<h3 id="org8254f5e">distribution of sample average and standard deviation</h3>
<div class="outline-text-3" id="text-org8254f5e">
</div>
<div id="outline-container-org22ca692" class="outline-4">
<h4 id="org22ca692">generating data</h4>
<div class="outline-text-4" id="text-org22ca692">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/QLVO-twLJU4" frameborder="0" allowfullscreen>generating data</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>some estimators have known (analytical) distributions</li>
<li>this is usually not the case with advanced models in datascience</li>
<li>hence we need to know how to simulate such distributions</li>
<li>we first simulate the distribution of a sample average \(m\)</li>
<li>we use the code <code>tf.random.uniform([N_simulations,sample_size],0,1)</code> to generate <code>N_simulations</code> times a sample of size <code>sample_size</code></li>
<li>this results in a dataset with <code>N_simulations</code> rows and <code>sample_size</code> columns</li>
<li><code>tf.random.uniform?</code> to see how this function can be used</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>generate data that is drawn from a normal distribution with mean 0 and standard deviation 1</li>
</ul>
</div>
</div>
