org-files/pagescreencasts.org
*** distribution sample mean

[[yt:GysdEGpCfk4][sample mean]]

Topics we cover in this video:
- calculating the mean across an axis with =np.mean(data, axis = 1)=
- making a histogram with matplotlib's =hist= function; setting =density= and =bins=
- adding title and labels on the axes

Questions you should be able to answer before continuing:
-  change the values for =N_simulations= and =sample_size= and plot the histogram of $m$; what do you find? How does, for instance, the standard deviation in the histogram vary with these parameters?

*** standard deviation of $m$

[[yt:ancSPkoYnX8][standard deviation m]]

Topics we cover in this video:
- we show how the standard deviation of $m$ varies with the sample size $n$
- we do this by creating an empty vector =vector_std= and for each sample size we calculate the standard deviation of $m$ (across our =N_simulations=) and then add this to the vector with =vector_std.append()=
- using =plt.scatter= we plot the sample size against this standard deviation
  
Questions you should be able to answer before continuing:
- how do we usually call "the standard deviation of $m$"?
- what is the analytical expression for the relation between sample size $n$ and the standard deviation of $m$?
  - to find this relation, you can check [[https://en.wikipedia.org/wiki/Continuous_uniform_distribution][wikipedia]] to find the expression for the variance $V(x)$
  - or to numerically approximate it, you can use =np.std(tf.random.uniform([10000],0,1))=
  - use python to check that both these approaches give the same answer and explain why
  
*** distribution of $s$

[[yt:0Qsxh_BArZY][distribution of the standard deviation]]

Topics we cover in this video:
- we calculate the standard deviation of the sample (of 10 draws) across columns with  =np.std(data, axis = 1)=
- we plot this distribution of =N_simulations= values of $s$ with =plt.hist()=
- then we use a boolean expression to calculate the probability that $s$ is below 0.20
  - since =True= is represented in python by 1 (and =False= by 0), =np.sum(data_std < 0.20)= gives the number of case (out of =N_simulations=) where the standard deviation is below 0.20
  - dividing this by =N_simulations= (or equivalently =len(data_std)=) gives us the fraction or probability that $s<0.20$
  
Questions you should be able to answer before continuing:
- calculate the probability that $s \in [0.20,0.30]$


**  distribution of a slope

*** generating data

[[yt:D9uaz2dPMRw][generating data]]

Topics we cover in this video:
- how to generate $x$ observations denoted =simulated_x= and then use these to generate data on $y$ denoted =simulated_y= of the format $y = \beta_0 + \beta_1 x + \varepsilon$
  
Questions you should be able to answer before continuing:
- what values of $\beta_0$ and $\beta_1$ do we use in the video and which values in the notebook?
- how does the distribution of $\varepsilon$ differ in the video and in the notebook? In particular, what is the standard deviation of $\varepsilon$ in the notebook? [hint: this is not 1.0]
- generate =simulated_x= using a different distribution than the normal distribution, e.g. use a gamma distribution for $x$.

*** doing OLS on your data

[[yt:MDinBLqliIw][doing OLS]]

Topics we cover in this video:
- make a scatter plot for one of our =N_simulations= datasets
- for this dataset do an OLS regression using =statsmodels= (see the [[https://www.statsmodels.org/stable/regression.html][website]] for details on the syntax; but for this course you do not need to learn =statsmodels=)
- some libraries, like =statsmodels=, cannot work with tensorflow arrays directly; you can use the =.numpy()= method to avoid problems
- plot the estimated OLS line in the scatter plot
  
Questions you should be able to answer before continuing:
- in the same scatter plot, present two datasets and two estimated OLS lines; that is, work with =simulated_x[0,:],simulated_y[0,:]= and =simulated_x[1,:],simulated_y[1,:]= in the same figure

*** distribution of slopes

[[yt:YiZV985oB5k][distribution of slopes]]

Topics we cover in this video:
- use a for-loop to run =N_simulations= OLS regressions
- using the =.append()= method to add the estimated slopes and constants to their resp. lists
- then plot the slopes with a histogram
- plot the estimated OLS lines in $(x,y)$ space
  
Questions you should be able to answer before continuing:
- what is the probability that the slope is lower than $-2.2$?

**  bootstrapping

[[yt:69zsXfKib2o][bootstrapping]]

Topics we cover in this video:
- generate your own data: here two data sets $A$ and $B$
- calculate the observed difference in means for the 2 data sets: $m_{A}, m_B$
- is the difference $m_A - m_B$ significant?
- under the null hypothesis that $A$ and $B$ were drawn from the same distribution, we can concatenate our data sets $A$ and $B$ into one big data set denoted $AB$
- out of $AB$ we generate 10,000 data sets $\tilde A$ and 10,000 data sets $\tilde B$ and we calculate the difference $m_{\tilde A}-m_{\tilde B}$ 10,000 times; hence we get the distribution of our statistic the difference in means between $A$ and $B$
- then we see how likely it is that the difference exceeds the observed difference $m_A - m_B$
- if this is not likely, we say that it is not likely that $A$ and $B$ were drawn from the same distribution
- we use =tf.concat= to merge the two data sets and
- =np.random.shuffle= to shuffle the rows of the combined data set $AB$ to generate new samples for $\tilde A$ and $\tilde B$
  
Questions you should be able to answer before continuing:
- plot the distribution of the differences
- redo this exercise specifying different values for =delta=; for which values of =delta= (not equal to 1) do you find that the null hypothesis is not rejected?
- Suppose you have a data set with a $y$ column and an $x$ column. You run a regression of $y$ on $x$ and a constant and find that the slope on the $x$ variable equals 0.05. How can you use bootstrapping to test whether this slope equals 0? [hint: if the slope is zero, what does this say about the rows $(x_i,y_i)$ in your data set?]

