pagescreencasts.html

<div id="outline-container-org6b42b34" class="outline-4">
<h4 id="org6b42b34">distribution sample mean</h4>
<div class="outline-text-4" id="text-org6b42b34">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/GysdEGpCfk4" frameborder="0" allowfullscreen>sample mean</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>calculating the mean across an axis with <code>np.mean(data, axis = 1)</code></li>
<li>making a histogram with matplotlib's <code>hist</code> function; setting <code>density</code> and <code>bins</code></li>
<li>adding title and labels on the axes</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>change the values for <code>N_simulations</code> and <code>sample_size</code> and plot the histogram of \(m\); what do you find? How does, for instance, the standard deviation in the histogram vary with these parameters?</li>
</ul>
</div>
</div>

<div id="outline-container-orgd140524" class="outline-4">
<h4 id="orgd140524">standard deviation of \(m\)</h4>
<div class="outline-text-4" id="text-orgd140524">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/ancSPkoYnX8" frameborder="0" allowfullscreen>standard deviation m</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>we show how the standard deviation of \(m\) varies with the sample size \(n\)</li>
<li>we do this by creating an empty vector <code>vector_std</code> and for each sample size we calculate the standard deviation of \(m\) (across our <code>N_simulations</code>) and then add this to the vector with <code>vector_std.append()</code></li>
<li>using <code>plt.scatter</code> we plot the sample size against this standard deviation</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>how do we usually call "the standard deviation of \(m\)"?</li>
<li>what is the analytical expression for the relation between sample size \(n\) and the standard deviation of \(m\)?
<ul class="org-ul">
<li>to find this relation, you can check <a href="https://en.wikipedia.org/wiki/Continuous_uniform_distribution">wikipedia</a> to find the expression for the variance \(V(x)\)</li>
<li>or to numerically approximate it, you can use <code>np.std(tf.random.uniform([10000],0,1))</code></li>
<li>use python to check that both these approaches give the same answer and explain why</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9cc1a20" class="outline-4">
<h4 id="org9cc1a20">distribution of \(s\)</h4>
<div class="outline-text-4" id="text-org9cc1a20">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/0Qsxh_BArZY" frameborder="0" allowfullscreen>distribution of the standard deviation</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>we calculate the standard deviation of the sample (of 10 draws) across columns with  <code>np.std(data, axis = 1)</code></li>
<li>we plot this distribution of <code>N_simulations</code> values of \(s\) with <code>plt.hist()</code></li>
<li>then we use a boolean expression to calculate the probability that \(s\) is below 0.20
<ul class="org-ul">
<li>since <code>True</code> is represented in python by 1 (and <code>False</code> by 0), <code>np.sum(data_std &lt; 0.20)</code> gives the number of case (out of <code>N_simulations</code>) where the standard deviation is below 0.20</li>
<li>dividing this by <code>N_simulations</code> (or equivalently <code>len(data_std)</code>) gives us the fraction or probability that \(s<0.20\)</li>
</ul></li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>calculate the probability that \(s \in [0.20,0.30]\)</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org7b9e2de" class="outline-3">
<h3 id="org7b9e2de">distribution of a slope</h3>
<div class="outline-text-3" id="text-org7b9e2de">
</div>
<div id="outline-container-org40a20d7" class="outline-4">
<h4 id="org40a20d7">generating data</h4>
<div class="outline-text-4" id="text-org40a20d7">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/D9uaz2dPMRw" frameborder="0" allowfullscreen>generating data</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>how to generate \(x\) observations denoted <code>simulated_x</code> and then use these to generate data on \(y\) denoted <code>simulated_y</code> of the format \(y = \beta_0 + \beta_1 x + \varepsilon\)</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>what values of \(\beta_0\) and \(\beta_1\) do we use in the video and which values in the notebook?</li>
<li>how does the distribution of \(\varepsilon\) differ in the video and in the notebook? In particular, what is the standard deviation of \(\varepsilon\) in the notebook? [hint: this is not 1.0]</li>
<li>generate <code>simulated_x</code> using a different distribution than the normal distribution, e.g. use a gamma distribution for \(x\).</li>
</ul>
</div>
</div>

<div id="outline-container-org76da180" class="outline-4">
<h4 id="org76da180">doing OLS on your data</h4>
<div class="outline-text-4" id="text-org76da180">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/MDinBLqliIw" frameborder="0" allowfullscreen>doing OLS</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>make a scatter plot for one of our <code>N_simulations</code> datasets</li>
<li>for this dataset do an OLS regression using <code>statsmodels</code> (see the <a href="https://www.statsmodels.org/stable/regression.html">website</a> for details on the syntax; but for this course you do not need to learn <code>statsmodels</code>)</li>
<li>some libraries, like <code>statsmodels</code>, cannot work with tensorflow arrays directly; you can use the <code>.numpy()</code> method to avoid problems</li>
<li>plot the estimated OLS line in the scatter plot</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>in the same scatter plot, present two datasets and two estimated OLS lines; that is, work with <code>simulated_x[0,:],simulated_y[0,:]</code> and <code>simulated_x[1,:],simulated_y[1,:]</code> in the same figure</li>
</ul>
</div>
</div>

<div id="outline-container-orgab1c49e" class="outline-4">
<h4 id="orgab1c49e">distribution of slopes</h4>
<div class="outline-text-4" id="text-orgab1c49e">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/YiZV985oB5k" frameborder="0" allowfullscreen>distribution of slopes</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>use a for-loop to run <code>N_simulations</code> OLS regressions</li>
<li>using the <code>.append()</code> method to add the estimated slopes and constants to their resp. lists</li>
<li>then plot the slopes with a histogram</li>
<li>plot the estimated OLS lines in \((x,y)\) space</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>what is the probability that the slope is lower than \(-2.2\)?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4dd0178" class="outline-3">
<h3 id="org4dd0178">bootstrapping</h3>
<div class="outline-text-3" id="text-org4dd0178">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/69zsXfKib2o" frameborder="0" allowfullscreen>bootstrapping</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>generate your own data: here two data sets \(A\) and \(B\)</li>
<li>calculate the observed difference in means for the 2 data sets: \(m_{A}, m_B\)</li>
<li>is the difference \(m_A - m_B\) significant?</li>
<li>under the null hypothesis that \(A\) and \(B\) were drawn from the same distribution, we can concatenate our data sets \(A\) and \(B\) into one big data set denoted \(AB\)</li>
<li>out of \(AB\) we generate 10,000 data sets \(\tilde A\) and 10,000 data sets \(\tilde B\) and we calculate the difference \(m_{\tilde A}-m_{\tilde B}\) 10,000 times; hence we get the distribution of our statistic the difference in means between \(A\) and \(B\)</li>
<li>then we see how likely it is that the difference exceeds the observed difference \(m_A - m_B\)</li>
<li>if this is not likely, we say that it is not likely that \(A\) and \(B\) were drawn from the same distribution</li>
<li>we use <code>tf.concat</code> to merge the two data sets and</li>
<li><code>np.random.shuffle</code> to shuffle the rows of the combined data set \(AB\) to generate new samples for \(\tilde A\) and \(\tilde B\)</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>plot the distribution of the differences</li>
<li>redo this exercise specifying different values for <code>delta</code>; for which values of <code>delta</code> (not equal to 1) do you find that the null hypothesis is not rejected?</li>
<li>Suppose you have a data set with a \(y\) column and an \(x\) column. You run a regression of \(y\) on \(x\) and a constant and find that the slope on the \(x\) variable equals 0.05. How can you use bootstrapping to test whether this slope equals 0? [hint: if the slope is zero, what does this say about the rows \((x_i,y_i)\) in your data set?]</li>
</ul>
</div>
</div>
