org-files/pagescreencasts.org
** Doing your own OLS and lasso regressions

[[yt:r2QteNGlMYM][OLS and lasso]]

Topics we cover in this video:
- defining tensorflow vectors and using =tf.concat= to create a matrix $X$ with these vectors as columns
- using =tf.ones= to create a column that consists of 1's
- then we define the difference between our observations and our OLS line as $y-Xw$ where $w$ consists of the constant, the slope of the first variable and the slope of the second variable; for now think (incorrectly) of $Xw$ as a matrix multiplication (once we get to "broadcasting" you will see what it really is)
- we define a function =loss= which equals the sum of the squared differences between $y$ and our prediction $Xw$
- we use =optimize.fmin= to minimize the loss function; =fmin= requires the function to be minimized and an initial guess for the variables (here $w$) over which we minimize the function
- this minimization gives us the OLS estimates of $w$
- for lasso and ridge regressions, the $x$ and $y$ variables need to be standardized; our $x$ variables are standardized by the way we defined them (zero mean and standard deviation equal to one); so we only center $y$ such that the centered variable has mean 0
- we define the loss function for a lasso regression which is a function of the coefficients $w$ and a penalty term $\lambda$.
  
Questions you should be able to answer before continuing:
- minimize =loss-lasso(w,0)=; which coefficients $w$ do you find?
- are they identical to $w$ minimizing =loss(w)=? Why (not)?
- try =w_guess = tf.zeros([3])= and =w_guess = tf.zeros([3,1])= in the code. Do both of these work as well?
- generate the data with =constant= and =slope2= not equal to zero. Then estimate the OLS and lasso coefficients.

* Causality 

** Fork

[[yt:eYYxS6HBAEI][Fork]]

Topics we cover in this video:
- generate our own data where $Z$ causes $X$ and $Y$ but there is no causal link between $X$ and $Y$
- create a panda's dataframe with the three variables $x,y,x$ using =pd.DataFrame= and specify a dictionary of the form: ={'column name':variable name}=
- generate OLS results from the regression $y = b_0 + b_x x$ using statsmodels (again: you do not need to know statsmodels for this course)
- this regression shows that $b_x$ is significantly different from 0
  - this is correct: there is a strong correlation between $x$ and $y$
- you may be tempted to interpret this as a causal effect of $x$ on $y$
  - this is not correct: the way we generated the data in python clearly shows that there is no causal effect of $x$ on $y$
- A fork can be easily solved: just run the regression $y = b_0 + b_x x + b_z z$ and this will show the unbiased estimate of $b_x$: in our model we find that after controlling for $z$, there is no significant effect anymore of $x$ on $y$.
  
Questions you should be able to answer before continuing:
- Write $y = \beta_0 + \beta_x x + \beta_z z + \varepsilon$; then in the video we consider the case with $\beta_x = 0$
  - now program your data such that $\beta_x \neq 0$
  - first run the regression $y = b_0 + b_x x$: do you find $b_x = \beta_x$?
  - then run the regression $y = b_0 + b_x x + b_z z$: how do $b_x$ and $ \beta_x$ compare now?

** Pipe

[[yt:BWLrbqho8Hs][Pipe]]

Topics we cover in this video:
- we generate data where $X$ causes $Z$ and $Z$ causes $Y$
- hence there is a causal effect of $X$ on $Y$ (via $Z$)
- running a regression $y = b_0 + b_x x + b_z z$ shows that $b_x$ is not significantly different from 0
  - hence you could incorrectly infer that $X$ has no causal effect on $Y$ (but actually it does in the data that we generated)
- this regression shows that after controlling for $Z$, $X$ has no (additional) effect on $Y$
- hence with a fork the regression $y = b_0 + b_x x + b_z z$ suggests the correct causal interpretation of $X$ on $Y$ but with a pipe this regression gives the wrong impression of the causal effect of $X$ on $Y$: so which one should you use in practice?
- your knowledge of the world should help you figure out whether you are in a fork or pipe "situation" and hence which regression gives the correct suggestion of causal effects.
  
Questions you should be able to answer before continuing:
- with the data generated in the video, run the regression $y = b_0 + b_x x$: does this provide the correct value for $b_x$
- generate data using $y = \beta_0 + \beta_x x + \beta_z z + \varepsilon$ with $\beta_x \neq 0$. Which regression gives the correct size of the causal effect of $X$ on $Y$? Can you determine this correct size analytically?

** Collider

[[yt:VrfDU1Dl9G8][Collider]]

Topics we cover in this video:
- we create a dataset with a collider
- we run the regression of $Y$ on $X$ and $Z$ and find a negative effect of $X$ on $Y$
  - this is puzzling because in our data $X$ has a positive effect on $Z$ and $Z$ has a positive effect on $Y$
  - hence where is the negative effect coming from?
- when running a regression like $y = b_0 + b_x x + b_z z$, the interpretation of $b_x$ is the effect of $x$ for a given value of $z$
- hence we plot the relation between $X$ and $Y$ for a given value of $Z$: this scatter plot reveals a negative correlation
- when controlling for parent's education $Z$, a well educated grandparent must have lived in a neighborhood that is not so great; while a grandparent (with the same $Z$, educational achievement of the parent) who has low education her/himself must have lived in great neighborhood. The former grandparent's grandchild lives in the same bad neighborhood and has low educational achievement while the latter grandchild's educational achievement is boosted by the good neighborhood they live in.
- this explains the negative correlation between $X$ and $Y$ controlling for $Z$
  
Questions you should be able to answer before continuing:
- run the regression of $Y$ on $X$ only: what effect do you find?
- include the neighborhood effects $U$ in the dataframe and run the regression of $Y$ on $X, Z$ and $U$: what effects do you find?


* Tensors

