pagescreencasts.html

<div id="outline-container-org2d56c80" class="outline-3">
<h3 id="org2d56c80">Doing your own OLS and lasso regressions</h3>
<div class="outline-text-3" id="text-org2d56c80">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/r2QteNGlMYM" frameborder="0" allowfullscreen>OLS and lasso</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>defining tensorflow vectors and using <code>tf.concat</code> to create a matrix \(X\) with these vectors as columns</li>
<li>using <code>tf.ones</code> to create a column that consists of 1's</li>
<li>then we define the difference between our observations and our OLS line as \(y-Xw\) where \(w\) consists of the constant, the slope of the first variable and the slope of the second variable; for now think (incorrectly) of \(Xw\) as a matrix multiplication (once we get to "broadcasting" you will see what it really is)</li>
<li>we define a function <code>loss</code> which equals the sum of the squared differences between \(y\) and our prediction \(Xw\)</li>
<li>we use <code>optimize.fmin</code> to minimize the loss function; <code>fmin</code> requires the function to be minimized and an initial guess for the variables (here \(w\)) over which we minimize the function</li>
<li>this minimization gives us the OLS estimates of \(w\)</li>
<li>for lasso and ridge regressions, the \(x\) and \(y\) variables need to be standardized; our \(x\) variables are standardized by the way we defined them (zero mean and standard deviation equal to one); so we only center \(y\) such that the centered variable has mean 0</li>
<li>we define the loss function for a lasso regression which is a function of the coefficients \(w\) and a penalty term \(\lambda\).</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>minimize <code>loss-lasso(w,0)</code>; which coefficients \(w\) do you find?</li>
<li>are they identical to \(w\) minimizing <code>loss(w)</code>? Why (not)?</li>
<li>try <code>w_guess = tf.zeros([3])</code> and <code>w_guess = tf.zeros([3,1])</code> in the code. Do both of these work as well?</li>
<li>generate the data with <code>constant</code> and <code>slope2</code> not equal to zero. Then estimate the OLS and lasso coefficients.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4168865" class="outline-2">
<h2 id="org4168865">Causality</h2>
<div class="outline-text-2" id="text-org4168865">
</div>
<div id="outline-container-orga05121a" class="outline-3">
<h3 id="orga05121a">Fork</h3>
<div class="outline-text-3" id="text-orga05121a">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/eYYxS6HBAEI" frameborder="0" allowfullscreen>Fork</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>generate our own data where \(Z\) causes \(X\) and \(Y\) but there is no causal link between \(X\) and \(Y\)</li>
<li>create a panda's dataframe with the three variables \(x,y,x\) using <code>pd.DataFrame</code> and specify a dictionary of the form: <code>{'column name':variable name}</code></li>
<li>generate OLS results from the regression \(y = b_0 + b_x x\) using statsmodels (again: you do not need to know statsmodels for this course)</li>
<li>this regression shows that \(b_x\) is significantly different from 0
<ul class="org-ul">
<li>this is correct: there is a strong correlation between \(x\) and \(y\)</li>
</ul></li>
<li>you may be tempted to interpret this as a causal effect of \(x\) on \(y\)
<ul class="org-ul">
<li>this is not correct: the way we generated the data in python clearly shows that there is no causal effect of \(x\) on \(y\)</li>
</ul></li>
<li>A fork can be easily solved: just run the regression \(y = b_0 + b_x x + b_z z\) and this will show the unbiased estimate of \(b_x\): in our model we find that after controlling for \(z\), there is no significant effect anymore of \(x\) on \(y\).</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>Write \(y = \beta_0 + \beta_x x + \beta_z z + \varepsilon\); then in the video we consider the case with \(\beta_x = 0\)
<ul class="org-ul">
<li>now program your data such that \(\beta_x \neq 0\)</li>
<li>first run the regression \(y = b_0 + b_x x\): do you find \(b_x = \beta_x\)?</li>
<li>then run the regression \(y = b_0 + b_x x + b_z z\): how do \(b_x\) and $ &beta;<sub>x</sub>$ compare now?</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6db5442" class="outline-3">
<h3 id="org6db5442">Pipe</h3>
<div class="outline-text-3" id="text-org6db5442">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/BWLrbqho8Hs" frameborder="0" allowfullscreen>Pipe</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>we generate data where \(X\) causes \(Z\) and \(Z\) causes \(Y\)</li>
<li>hence there is a causal effect of \(X\) on \(Y\) (via \(Z\))</li>
<li>running a regression \(y = b_0 + b_x x + b_z z\) shows that \(b_x\) is not significantly different from 0
<ul class="org-ul">
<li>hence you could incorrectly infer that \(X\) has no causal effect on \(Y\) (but actually it does in the data that we generated)</li>
</ul></li>
<li>this regression shows that after controlling for \(Z\), \(X\) has no (additional) effect on \(Y\)</li>
<li>hence with a fork the regression \(y = b_0 + b_x x + b_z z\) suggests the correct causal interpretation of \(X\) on \(Y\) but with a pipe this regression gives the wrong impression of the causal effect of \(X\) on \(Y\): so which one should you use in practice?</li>
<li>your knowledge of the world should help you figure out whether you are in a fork or pipe "situation" and hence which regression gives the correct suggestion of causal effects.</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>with the data generated in the video, run the regression \(y = b_0 + b_x x\): does this provide the correct value for \(b_x\)</li>
<li>generate data using \(y = \beta_0 + \beta_x x + \beta_z z + \varepsilon\) with \(\beta_x \neq 0\). Which regression gives the correct size of the causal effect of \(X\) on \(Y\)? Can you determine this correct size analytically?</li>
</ul>
</div>
</div>

<div id="outline-container-org56e3357" class="outline-3">
<h3 id="org56e3357">Collider</h3>
<div class="outline-text-3" id="text-org56e3357">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/VrfDU1Dl9G8" frameborder="0" allowfullscreen>Collider</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>we create a dataset with a collider</li>
<li>we run the regression of \(Y\) on \(X\) and \(Z\) and find a negative effect of \(X\) on \(Y\)
<ul class="org-ul">
<li>this is puzzling because in our data \(X\) has a positive effect on \(Z\) and \(Z\) has a positive effect on \(Y\)</li>
<li>hence where is the negative effect coming from?</li>
</ul></li>
<li>when running a regression like \(y = b_0 + b_x x + b_z z\), the interpretation of \(b_x\) is the effect of \(x\) for a given value of \(z\)</li>
<li>hence we plot the relation between \(X\) and \(Y\) for a given value of \(Z\): this scatter plot reveals a negative correlation</li>
<li>when controlling for parent's education \(Z\), a well educated grandparent must have lived in a neighborhood that is not so great; while a grandparent (with the same \(Z\), educational achievement of the parent) who has low education her/himself must have lived in great neighborhood. The former grandparent's grandchild lives in the same bad neighborhood and has low educational achievement while the latter grandchild's educational achievement is boosted by the good neighborhood they live in.</li>
<li>this explains the negative correlation between \(X\) and \(Y\) controlling for \(Z\)</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>run the regression of \(Y\) on \(X\) only: what effect do you find?</li>
<li>include the neighborhood effects \(U\) in the dataframe and run the regression of \(Y\) on \(X, Z\) and \(U\): what effects do you find?</li>
</ul>
</div>
</div>
</div>
