org-files/pagescreencasts.org
** Introduction

[[yt:yJxsbWL9JUI][Introduction Tensors]]

Topics we cover in this video:
- we create a "normal" data set with variables like gdp, inflation, unemployment
  - this is basically a matrix: 2 dimensional data
  - columns are the variables and rows the observations (e.g. countries with cross section data, or time for a given country in time series data or a combination of countries over time in panel data)
- we download the mnist data set which consists of images of handwritten numbers
  - that is, one observation is a handwritten number in 2 dimensions
  - hence the data is 3 dimensional: the training data consists of 60,000 observations where each observation is a two dimensional image
  - tensors allow us to work with data in higher dimensions than two
      
Questions you should be able to answer before continuing:
- what is the dimension of =train_labels=?
- use =inflation.shape= to see that =inflation= is a two dimensional *tensor* [hint: the command returns 2 numbers]
- but what is the dimension of =inflation= as a *vector*? [hint: the distinction between dimensions as a vector and as a tensor is confusing at first, but you will get used to it]
- check what =train_labels[4]= is.
  
** Creating tensors with numpy

[[yt:XWCmZjjgeLs][tensors with numpy]]

Topics we cover in this video:
- create a tensor in numpy using the =.reshape= method
- using the =.shape= and =.ndim= methods to determine what the shape of the tensor is what its dimensions are
- a 100-dimensional column vector $x$ turns out to have dimension 1 as a tensor
- add a new dimension to a tensor using =np.newaxis=

Questions you should be able to answer before continuing:
- create a vector =y = np.arange(120)= and define =y5 = y.reshape(1,2,3,4,5)=
  - what is the shape of =y5=? And is dimensions?
  - to get a sense of what =y5= looks like, try things like =y5[:,0,0,0,0]= and  =y5[0,0,:,0,0]= and  =y5[0,0,:,:,0]=
  - you can also evaluate =y5= itself and you get the sense of a matrix of matrices; pay attention to the square brackets =[]= to see how python delineates dimensions in its output when evaluating =y5=
  
** Broadcasting

[[yt:4xUIQlbxHqI][broadcasting]]

Topics we cover in this video:
- numpy matrix multiplication using the =@= operator
- multiplying tensors using broadcasting
- multiplication, addition etc. of tensors is done element by element
- if the two tensors do not have the same shape, numpy uses broadcasting to get the tensors into the same shape
- broadcasting rules are:
  - start at the last dimension of the two tensors
  - these two dimensions are compatible if
    - either they are equal
    - or if they are not equal, at least one of them equals 1
  - if this is satisfied, move a dimension "to the left" and do the same check
  
Questions you should be able to answer before continuing:
- create two tensors yourself, e.g. using =np.arange= and =.reshape=, and try to add them together; create tensors where this does not work and then use =np.newaxis= to make the tensors compatible; check that you did this correctly by multiplying them and python should not throw an error
- check the examples in the notebook and predict --before running the code-- whether they can be broadcast together or notebook
  
** slicing and fancy indexing

[[yt:B0dU9F6v5U4][slicing and indexing]]

Topics we cover in this video:
- we create a 2-dimensional tensor $x$
- then we select the first element as =x[0,0]=, the last element as =x[-1,-1]=
- =x[:,a:b:c]= means we want all rows and then columns starting with index =a= up to (but not including) index =b= and we take steps =c=. If no value of =a= is specified we start at index 0, if no =b= is specified we go to the last element and if no =c= is specified we take step 1
- =c = -1= implies that we reverse the order
- fancy indexing uses boolean masks to select entries from a tensor: =x[x>0]= selects the positive elements out of the tensor =x=
- this can be used to plot a function where the color varies with the value of the function
    
Questions you should be able to answer before continuing:
- the slicing and indexing questions in the notebook should now be straightforward to do
- create a 4 dimensional tensor and make selections out the 4 dimensions

** First neural network

- After all the work of understanding tensors, the notebook presents a first example of a neural network. At this point you do not need to worry about the syntax (from =keras=) with which we build the neural network. Just go through the notebook and run the cells. The independent variable ($x$ variable, if you like) is now a two-dimensional figure: a handwritten number. The labels are the number that was handwritten in the figure. The network tries to predict this label based on the figure. The notebook takes you through the steps and checks accuracy.
- the $x$ variable in the train set is called =train_images= which is a 3-dimensional tensor of shape $(60000, 28, 28)$. You cannot work with such $x$ variables in an OLS regression, but the neural network has no problems with this.

* Overfitting and underfitting

