pagescreencasts.html


<div id="outline-container-orgc194898" class="outline-2">
<h2 id="orgc194898">Tensors</h2>
<div class="outline-text-2" id="text-orgc194898">
</div>
<div id="outline-container-orgda5fdc3" class="outline-3">
<h3 id="orgda5fdc3">Introduction</h3>
<div class="outline-text-3" id="text-orgda5fdc3">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/yJxsbWL9JUI" frameborder="0" allowfullscreen>Introduction Tensors</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>we create a "normal" data set with variables like gdp, inflation, unemployment
<ul class="org-ul">
<li>this is basically a matrix: 2 dimensional data</li>
<li>columns are the variables and rows the observations (e.g. countries with cross section data, or time for a given country in time series data or a combination of countries over time in panel data)</li>
</ul></li>
<li>we download the mnist data set which consists of images of handwritten numbers
<ul class="org-ul">
<li>that is, one observation is a handwritten number in 2 dimensions</li>
<li>hence the data is 3 dimensional: the training data consists of 60,000 observations where each observation is a two dimensional image</li>
<li>tensors allow us to work with data in higher dimensions than two</li>
</ul></li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>what is the dimension of <code>train_labels</code>?</li>
<li>use <code>inflation.shape</code> to see that <code>inflation</code> is a two dimensional <b>tensor</b> [hint: the command returns 2 numbers]</li>
<li>but what is the dimension of <code>inflation</code> as a <b>vector</b>? [hint: the distinction between dimensions as a vector and as a tensor is confusing at first, but you will get used to it]</li>
<li>check what <code>train_labels[4]</code> is.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc9bbfc3" class="outline-3">
<h3 id="orgc9bbfc3">Creating tensors with numpy</h3>
<div class="outline-text-3" id="text-orgc9bbfc3">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/XWCmZjjgeLs" frameborder="0" allowfullscreen>tensors with numpy</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>create a tensor in numpy using the <code>.reshape</code> method</li>
<li>using the <code>.shape</code> and <code>.ndim</code> methods to determine what the shape of the tensor is what its dimensions are</li>
<li>a 100-dimensional column vector \(x\) turns out to have dimension 1 as a tensor</li>
<li>add a new dimension to a tensor using <code>np.newaxis</code></li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>create a vector <code>y = np.arange(120)</code> and define <code>y5 = y.reshape(1,2,3,4,5)</code>
<ul class="org-ul">
<li>what is the shape of <code>y5</code>? And is dimensions?</li>
<li>to get a sense of what <code>y5</code> looks like, try things like <code>y5[:,0,0,0,0]</code> and  <code>y5[0,0,:,0,0]</code> and  <code>y5[0,0,:,:,0]</code></li>
<li>you can also evaluate <code>y5</code> itself and you get the sense of a matrix of matrices; pay attention to the square brackets <code>[]</code> to see how python delineates dimensions in its output when evaluating <code>y5</code></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd6f7d30" class="outline-3">
<h3 id="orgd6f7d30">Broadcasting</h3>
<div class="outline-text-3" id="text-orgd6f7d30">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/4xUIQlbxHqI" frameborder="0" allowfullscreen>broadcasting</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>numpy matrix multiplication using the <code>@</code> operator</li>
<li>multiplying tensors using broadcasting</li>
<li>multiplication, addition etc. of tensors is done element by element</li>
<li>if the two tensors do not have the same shape, numpy uses broadcasting to get the tensors into the same shape</li>
<li>broadcasting rules are:
<ul class="org-ul">
<li>start at the last dimension of the two tensors</li>
<li>these two dimensions are compatible if
<ul class="org-ul">
<li>either they are equal</li>
<li>or if they are not equal, at least one of them equals 1</li>
</ul></li>
<li>if this is satisfied, move a dimension "to the left" and do the same check</li>
</ul></li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>create two tensors yourself, e.g. using <code>np.arange</code> and <code>.reshape</code>, and try to add them together; create tensors where this does not work and then use <code>np.newaxis</code> to make the tensors compatible; check that you did this correctly by multiplying them and python should not throw an error</li>
<li>check the examples in the notebook and predict &#x2013;before running the code&#x2013; whether they can be broadcast together or notebook</li>
</ul>
</div>
</div>

<div id="outline-container-orgd747396" class="outline-3">
<h3 id="orgd747396">slicing and fancy indexing</h3>
<div class="outline-text-3" id="text-orgd747396">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/B0dU9F6v5U4" frameborder="0" allowfullscreen>slicing and indexing</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>we create a 2-dimensional tensor \(x\)</li>
<li>then we select the first element as <code>x[0,0]</code>, the last element as <code>x[-1,-1]</code></li>
<li><code>x[:,a:b:c]</code> means we want all rows and then columns starting with index <code>a</code> up to (but not including) index <code>b</code> and we take steps <code>c</code>. If no value of <code>a</code> is specified we start at index 0, if no <code>b</code> is specified we go to the last element and if no <code>c</code> is specified we take step 1</li>
<li><code>c = -1</code> implies that we reverse the order</li>
<li>fancy indexing uses boolean masks to select entries from a tensor: <code>x[x&gt;0]</code> selects the positive elements out of the tensor <code>x</code></li>
<li>this can be used to plot a function where the color varies with the value of the function</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>the slicing and indexing questions in the notebook should now be straightforward to do</li>
<li>create a 4 dimensional tensor and make selections out the 4 dimensions</li>
</ul>
</div>
</div>

<div id="outline-container-org8ad0fe2" class="outline-3">
<h3 id="org8ad0fe2">First neural network</h3>
<div class="outline-text-3" id="text-org8ad0fe2">
<ul class="org-ul">
<li>After all the work of understanding tensors, the notebook presents a first example of a neural network. At this point you do not need to worry about the syntax (from <code>keras</code>) with which we build the neural network. Just go through the notebook and run the cells. The independent variable (\(x\) variable, if you like) is now a two-dimensional figure: a handwritten number. The labels are the number that was handwritten in the figure. The network tries to predict this label based on the figure. The notebook takes you through the steps and checks accuracy.</li>
<li>the \(x\) variable in the train set is called <code>train_images</code> which is a 3-dimensional tensor of shape \((60000, 28, 28)\). You cannot work with such \(x\) variables in an OLS regression, but the neural network has no problems with this.</li>
</ul>
</div>
</div>
</div>
