org-files/pagescreencasts.org
** generating the data

[[yt:BIW0H6cB2DU][overfitting generating data]]

Topics we cover in this video:
- when doing OLS, adding variables always improves the fit/reduces the mean squared error (mse)
- there are two dangers when you keep adding variables to a regression:
  - as discussed above: you start to misinterpret the results in terms of causality
  - although mse falls, your predictions become worse at some point
- overfitting is the situation where you add so many variables that your predictions start to suffer
- with underfitting you did not add enough relevant variables and your predictions are less than optimal as well
- you get an idea of the over/underfitting of a model by splitting your data into a train and test data set
  - you estimate (train) your model on the train data
  - and evaluate your model on the test data
- we use =tf.keras.losses.mse= to evaluate the model; we provide this function with two variables: the observed $y$ values in the train data (=df_train['y']=) and the model prediction on the train data: =model.predict(df_train)=
  
Questions you should be able to answer before continuing:
- change the definition of the variable $y$ by adding terms $x^3,x^4$ to it. Then run the code again and see what happens to the development of the mse.
- change other parameters like =N_observations= and =train_size= and see the effects on the development of mse and with the code of the next video on performance on the test set.

** overfitting

[[yt:EXMt0LWgtVs][overfitting in test data]]

Topics we cover in this video:
- again we use =tf.keras.losses.mse= to evaluate the model but now with the observed $y$ values in the test data (=df_test['y']=) and the model prediction on the test data: =model.predict(df_test)=
- adding additional (irrelevant) variables basically destroys the prediction performance of the model on the test data
- in the video the mse for the test data is minimized by including the correct variables in the model (which we know as we generated the data ourselves)
- plotting the higher order models in $(x,y)$ space shows that they try to capture idiosyncratic features of the train data that do not generalize to the test data: this is why their prediction performance deteriorates by including more variables
    
Questions you should be able to answer before continuing:
- suppose you estimate a model on the train data and get great results on the test data. How can you be sure that this is no coincidence of the way you split the data into train and test data?
- is the following estimation procedure ok?
  - fix the train and test data
  - estimate a first version of the model on the train data and evaluate the result on the test data
  - then add new variables/delete some variables, change the functional form of the equation you estimate (and later on, change the hyper parameters of the model), estimate on the train data and evaluate on the test data
  - keep repeating this till you have minimized the mse on the test data

* Neural network

** perceptron

[[yt:BpKcGueisRI][update coefficients network]]

Topics we cover in this video:
- we use [[https://homepages.ecs.vuw.ac.nz/~marslast/Code/Ch3/pcn.py][Stephen Marsland]]'s code for the perceptron to understand how weights in a neural network are updated
- weight $w_0$ is updated according to the rule: $w_0 = w_0 - \eta(\hat t -t)x$ where $\eta$ denotes the learning rate, $\hat t$ is the current prediction of our neural network and $t$ is the true (correct) target for the point $x$. Hence, if $\hat t = t$ there is no need to update $w_0$ as far as point $x$ is concerned.
- we illustrate with a simple graph how this updating of weights improves the prediction of our model
    
Questions you should be able to answer before continuing:
- in the video we consider the case where $w_1 > 0$; check that this updating works as well in case $w_1 < 0$
- another way to update the line in the video is to leave $w_0$ unchanged and adapt $w_1$; check that the correction works as well for $w_1$
- do the section on the multi-layer perceptron in the notebook; if you have trouble downloading the data, check the video on tensor classification below.
- a great way to get some intuition on the workings of a neural network is to go to the [[http://playground.tensorflow.org/][playground]]
- if you need a break and want to have some fun with machine learning, go and [[https://quickdraw.withgoogle.com/][doodle]]

** tensorflow regression

*** the math

[[yt:TAFldQ-af40][tensorflow minimize]]

Topics we cover in this video:
- define a tensorflow variable $z$ with starting value 0:  =z = tf.Variable(0.0)=
- define a function using tensorflow variables and other variables
- calculate the derivative of a function w.r.t. a tensorflow variable using =tf.GradientTape()= and the =.gradient= method
- using this derivative to update the tensorflow variables to minimize a function
  
Questions you should be able to answer before continuing:
- define another function and use the method described in the video to minimize this function
- adapt the method to maximize a function (in particular the part =z.assign_sub=) and use it maximize the function $f(x,y) = 10 - x^2 - y^2$.

*** the regression

[[yt:wWjVn1Flphs][tensorflow regression]]

Topics we cover in this video:
- define a function to generate our own train data
- use tensorflow functions =tf.square= and =tf.reduce_mean= to define a loss function of the difference between true data $y$ and our prediction of $y$
- minimize this loss function to find the OLS estimates of the slope and intercept.
  
Questions you should be able to answer before continuing:
- use the function =make_noisy_data= defined in the video to generate other data and estimate the slope and intercept of this data
- extend the function =make_noisy_data= to allow for $y =b+ m_x x + m_z z + e$ and adapt the procedure to estimate $b,m_x$ and $m_z$

** tensorflow classification

