pagescreencasts.html

<div id="outline-container-org261e0ce" class="outline-2">
<h2 id="org261e0ce">Overfitting and underfitting</h2>
<div class="outline-text-2" id="text-org261e0ce">
</div>
<div id="outline-container-org9fba47a" class="outline-3">
<h3 id="org9fba47a">generating the data</h3>
<div class="outline-text-3" id="text-org9fba47a">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/BIW0H6cB2DU" frameborder="0" allowfullscreen>overfitting generating data</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>when doing OLS, adding variables always improves the fit/reduces the mean squared error (mse)</li>
<li>there are two dangers when you keep adding variables to a regression:
<ul class="org-ul">
<li>as discussed above: you start to misinterpret the results in terms of causality</li>
<li>although mse falls, your predictions become worse at some point</li>
</ul></li>
<li>overfitting is the situation where you add so many variables that your predictions start to suffer</li>
<li>with underfitting you did not add enough relevant variables and your predictions are less than optimal as well</li>
<li>you get an idea of the over/underfitting of a model by splitting your data into a train and test data set
<ul class="org-ul">
<li>you estimate (train) your model on the train data</li>
<li>and evaluate your model on the test data</li>
</ul></li>
<li>we use <code>tf.keras.losses.mse</code> to evaluate the model; we provide this function with two variables: the observed \(y\) values in the train data (<code>df_train['y']</code>) and the model prediction on the train data: <code>model.predict(df_train)</code></li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>change the definition of the variable \(y\) by adding terms \(x^3,x^4\) to it. Then run the code again and see what happens to the development of the mse.</li>
<li>change other parameters like <code>N_observations</code> and <code>train_size</code> and see the effects on the development of mse and with the code of the next video on performance on the test set.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb72bc1b" class="outline-3">
<h3 id="orgb72bc1b">overfitting</h3>
<div class="outline-text-3" id="text-orgb72bc1b">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/EXMt0LWgtVs" frameborder="0" allowfullscreen>overfitting in test data</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>again we use <code>tf.keras.losses.mse</code> to evaluate the model but now with the observed \(y\) values in the test data (<code>df_test['y']</code>) and the model prediction on the test data: <code>model.predict(df_test)</code></li>
<li>adding additional (irrelevant) variables basically destroys the prediction performance of the model on the test data</li>
<li>in the video the mse for the test data is minimized by including the correct variables in the model (which we know as we generated the data ourselves)</li>
<li>plotting the higher order models in \((x,y)\) space shows that they try to capture idiosyncratic features of the train data that do not generalize to the test data: this is why their prediction performance deteriorates by including more variables</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>suppose you estimate a model on the train data and get great results on the test data. How can you be sure that this is no coincidence of the way you split the data into train and test data?</li>
<li>is the following estimation procedure ok?
<ul class="org-ul">
<li>fix the train and test data</li>
<li>estimate a first version of the model on the train data and evaluate the result on the test data</li>
<li>then add new variables/delete some variables, change the functional form of the equation you estimate (and later on, change the hyper parameters of the model), estimate on the train data and evaluate on the test data</li>
<li>keep repeating this till you have minimized the mse on the test data</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3e3951d" class="outline-2">
<h2 id="org3e3951d">Neural network</h2>
<div class="outline-text-2" id="text-org3e3951d">
</div>
<div id="outline-container-org8378d0c" class="outline-3">
<h3 id="org8378d0c">perceptron</h3>
<div class="outline-text-3" id="text-org8378d0c">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/BpKcGueisRI" frameborder="0" allowfullscreen>update coefficients network</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>we use <a href="https://homepages.ecs.vuw.ac.nz/~marslast/Code/Ch3/pcn.py">Stephen Marsland</a>'s code for the perceptron to understand how weights in a neural network are updated</li>
<li>weight \(w_0\) is updated according to the rule: \(w_0 = w_0 - \eta(\hat t -t)x\) where \(\eta\) denotes the learning rate, \(\hat t\) is the current prediction of our neural network and \(t\) is the true (correct) target for the point \(x\). Hence, if \(\hat t = t\) there is no need to update \(w_0\) as far as point \(x\) is concerned.</li>
<li>we illustrate with a simple graph how this updating of weights improves the prediction of our model</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>in the video we consider the case where \(w_1 > 0\); check that this updating works as well in case \(w_1 < 0\)</li>
<li>another way to update the line in the video is to leave \(w_0\) unchanged and adapt \(w_1\); check that the correction works as well for \(w_1\)</li>
<li>do the section on the multi-layer perceptron in the notebook; if you have trouble downloading the data, check the video on tensor classification below.</li>
<li>a great way to get some intuition on the workings of a neural network is to go to the <a href="http://playground.tensorflow.org/">playground</a></li>
<li>if you need a break and want to have some fun with machine learning, go and <a href="https://quickdraw.withgoogle.com/">doodle</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4a47acc" class="outline-3">
<h3 id="org4a47acc">tensorflow regression</h3>
<div class="outline-text-3" id="text-org4a47acc">
</div>
<div id="outline-container-orgf3cb793" class="outline-4">
<h4 id="orgf3cb793">the math</h4>
<div class="outline-text-4" id="text-orgf3cb793">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/TAFldQ-af40" frameborder="0" allowfullscreen>tensorflow minimize</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>define a tensorflow variable \(z\) with starting value 0:  <code>z = tf.Variable(0.0)</code></li>
<li>define a function using tensorflow variables and other variables</li>
<li>calculate the derivative of a function w.r.t. a tensorflow variable using <code>tf.GradientTape()</code> and the <code>.gradient</code> method</li>
<li>using this derivative to update the tensorflow variables to minimize a function</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>define another function and use the method described in the video to minimize this function</li>
<li>adapt the method to maximize a function (in particular the part <code>z.assign_sub</code>) and use it maximize the function \(f(x,y) = 10 - x^2 - y^2\).</li>
</ul>
</div>
</div>

<div id="outline-container-orgee35b8e" class="outline-4">
<h4 id="orgee35b8e">the regression</h4>
<div class="outline-text-4" id="text-orgee35b8e">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/wWjVn1Flphs" frameborder="0" allowfullscreen>tensorflow regression</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>define a function to generate our own train data</li>
<li>use tensorflow functions <code>tf.square</code> and <code>tf.reduce_mean</code> to define a loss function of the difference between true data \(y\) and our prediction of \(y\)</li>
<li>minimize this loss function to find the OLS estimates of the slope and intercept.</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>use the function <code>make_noisy_data</code> defined in the video to generate other data and estimate the slope and intercept of this data</li>
<li>extend the function <code>make_noisy_data</code> to allow for \(y =b+ m_x x + m_z z + e\) and adapt the procedure to estimate \(b,m_x\) and \(m_z\)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9cac2c0" class="outline-3">
<h3 id="org9cac2c0">tensorflow classification</h3>
<div class="outline-text-3" id="text-org9cac2c0">
</div>
