org-files/pagescreencasts.org
*** getting the data ready

[[yt:aTUcFsWPBJ8][getting data ready]]

Topics we cover in this video:
- getting the data using =urllib.request=
- using pandas =.read_csv()=to read the data
- using =.replace()= to replace the flower names (strings) by numbers (integers)
- normalizing the features of the data set
- plot the data with different colors for each flower type

  
Questions you should be able to answer before continuing:
- plot the data for all combinations of features (feature 0 and 1; 0 and 2 etc.) to see which dimensions seem most helpful to classify the data into the different flower types
- compare the data normalization steps that we do here with the ones used in the notebook in the section Multi-layer perceptron: which parts are the same, which differ?

*** estimating the network

[[yt:lNoK-NdW1sQ][estimating network]]

Topics we cover in this video:
- split the data into train and test set
- specify the network using the =keras= syntax
- we use two layers with 'relu' activation and the final layer with 'softmax', this gives us prediction probabilities over the 3 flower types in our data
- we then compile the model specifying the optimizer, loss function and the metrics we would like to see during the fitting stage
- we fit the model using the train data (features and targets) and we specify the number of epochs
  - as the number of epochs increases, the loss on the train data falls, but this can lead to over-fitting; later we will see how you can determine the optimal number of epochs (avoiding both over-fitting and under-fitting)
- we evaluate the data on the test set.

Questions you should be able to answer before continuing:
- which mistake is made in the video when splitting the data into a train and test set? You can increase the 'epochs' to improve the fit on the train data, but the evaluation on the test set will not really improve. [hint: in the section Multi-layer perceptron in the notebook we use the iris data for the first time. Carefully check the steps we take there: which one did we miss here? check the data to see why this step matters]
- increase the number of epochs and compare the fit on the train data with the fit on the test data


* Back to our first neural network

** defining the network and fitting it

[[yt:bqY-iOitEYk][defining the network]]

Topics we cover in this video:
- loading the mnist data
- normalizing our variable
- defining the model using =keras.Sequential= for the different layers
- using activations relu and softmax
- in the =compile= step we specify the optimizer, the loss function and other metrics that we want to see when the model is fit to the data
- finally we =fit= the model
  
Questions you should be able to answer before continuing:
- when do you use relu and when softmax activations?
- what is a =Dense= layer?
- what is an epoch?

** checking the fit

[[yt:wq8lxJ-ugwM][checking the fit]]

Topics we cover in this video:
- how to evaluate your fitted model on the test data
- with a classification model the prediction is an array with probabilities
- the highest probability in this array gives the most likely label for the observation
  
Questions you should be able to answer before continuing:
- compare the prediction with the label for 5 different test observations.

** number of epochs and overfitting

[[yt:cEJQJQ2wSgI][choosing the number of epochs]]

Topics we cover in this video:
- use the history of =model.fit= to see the model's performance as a function of the number of epochs
- plot the loss on the train data and the loss on the validation (or test) data
- the number of epochs where the validation loss "levels off" is the right number of epochs to use
- the loss on the train data keeps falling with the number of epochs beyond this point, but this is due to overfitting
  
Questions you should be able to answer before continuing:
- make a similar plot for model accuracy and the number of epochs
- experiment with the network architecture to see how this affects the optimal number of epochs:
  - increase the number of nodes in a layer
  - increase the number of layers in the network
- specify a model that clearly overfits the data


* Treatment effects

** IV

*** generating our data

[[yt:o5O2P8DrAZA][generating our data]]

Topics we cover in this video:
- we generate data with no direct (causal) effect of education on wage
- with an OLS estimation we find a positive and significant effect of education on the wage rate
- hence OLS is not the correct estimator to find the causal effect of education on wage
  
Questions you should be able to answer before continuing:
- define a function that generates the data, runs the OLS and returns the results as a function of the parameters =alpha_w, alpha_e, beta_ew, beta_qe=.
- for different values of the parameters, see what the OLS result is; e.g. what happens to the OLS estimation of the effect of education on wage in case =alpha_ew= equals 1.0?

*** IV estimate  

[[yt:GjBvmgOB4TU][IV estimate]]

Topics we cover in this video:
- using IV we correctly identify the causal effect of education on wage
- the first stage correctly captures the effect of the instrument =q= on education
  
Questions you should be able to answer before continuing:
- which properties of =q= make it a valid instrument?
- generate data with =alpha_ew= equal to 1; can the IV estimation correctly identify this parameter?

** Heterogenous treatment effects

