pagescreencasts.html
<div id="outline-container-orgf6cde40" class="outline-4">
<h4 id="orgf6cde40">getting the data ready</h4>
<div class="outline-text-4" id="text-orgf6cde40">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/aTUcFsWPBJ8" frameborder="0" allowfullscreen>getting data ready</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>getting the data using <code>urllib.request</code></li>
<li>using pandas =.read<sub>csv</sub>()=to read the data</li>
<li>using <code>.replace()</code> to replace the flower names (strings) by numbers (integers)</li>
<li>normalizing the features of the data set</li>
<li>plot the data with different colors for each flower type</li>
</ul>


<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>plot the data for all combinations of features (feature 0 and 1; 0 and 2 etc.) to see which dimensions seem most helpful to classify the data into the different flower types</li>
<li>compare the data normalization steps that we do here with the ones used in the notebook in the section Multi-layer perceptron: which parts are the same, which differ?</li>
</ul>
</div>
</div>

<div id="outline-container-orgcfac328" class="outline-4">
<h4 id="orgcfac328">estimating the network</h4>
<div class="outline-text-4" id="text-orgcfac328">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/lNoK-NdW1sQ" frameborder="0" allowfullscreen>estimating network</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>split the data into train and test set</li>
<li>specify the network using the <code>keras</code> syntax</li>
<li>we use two layers with 'relu' activation and the final layer with 'softmax', this gives us prediction probabilities over the 3 flower types in our data</li>
<li>we then compile the model specifying the optimizer, loss function and the metrics we would like to see during the fitting stage</li>
<li>we fit the model using the train data (features and targets) and we specify the number of epochs
<ul class="org-ul">
<li>as the number of epochs increases, the loss on the train data falls, but this can lead to over-fitting; later we will see how you can determine the optimal number of epochs (avoiding both over-fitting and under-fitting)</li>
</ul></li>
<li>we evaluate the data on the test set.</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>which mistake is made in the video when splitting the data into a train and test set? You can increase the 'epochs' to improve the fit on the train data, but the evaluation on the test set will not really improve. [hint: in the section Multi-layer perceptron in the notebook we use the iris data for the first time. Carefully check the steps we take there: which one did we miss here? check the data to see why this step matters]</li>
<li>increase the number of epochs and compare the fit on the train data with the fit on the test data</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-orgef90c27" class="outline-2">
<h2 id="orgef90c27">Back to our first neural network</h2>
<div class="outline-text-2" id="text-orgef90c27">
</div>
<div id="outline-container-org455a7fe" class="outline-3">
<h3 id="org455a7fe">defining the network and fitting it</h3>
<div class="outline-text-3" id="text-org455a7fe">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/bqY-iOitEYk" frameborder="0" allowfullscreen>defining the network</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>loading the mnist data</li>
<li>normalizing our variable</li>
<li>defining the model using <code>keras.Sequential</code> for the different layers</li>
<li>using activations relu and softmax</li>
<li>in the <code>compile</code> step we specify the optimizer, the loss function and other metrics that we want to see when the model is fit to the data</li>
<li>finally we <code>fit</code> the model</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>when do you use relu and when softmax activations?</li>
<li>what is a <code>Dense</code> layer?</li>
<li>what is an epoch?</li>
</ul>
</div>
</div>

<div id="outline-container-org4f88ebc" class="outline-3">
<h3 id="org4f88ebc">checking the fit</h3>
<div class="outline-text-3" id="text-org4f88ebc">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/wq8lxJ-ugwM" frameborder="0" allowfullscreen>checking the fit</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>how to evaluate your fitted model on the test data</li>
<li>with a classification model the prediction is an array with probabilities</li>
<li>the highest probability in this array gives the most likely label for the observation</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>compare the prediction with the label for 5 different test observations.</li>
</ul>
</div>
</div>

<div id="outline-container-org3577a3b" class="outline-3">
<h3 id="org3577a3b">number of epochs and overfitting</h3>
<div class="outline-text-3" id="text-org3577a3b">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/cEJQJQ2wSgI" frameborder="0" allowfullscreen>choosing the number of epochs</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>use the history of <code>model.fit</code> to see the model's performance as a function of the number of epochs</li>
<li>plot the loss on the train data and the loss on the validation (or test) data</li>
<li>the number of epochs where the validation loss "levels off" is the right number of epochs to use</li>
<li>the loss on the train data keeps falling with the number of epochs beyond this point, but this is due to overfitting</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>make a similar plot for model accuracy and the number of epochs</li>
<li>experiment with the network architecture to see how this affects the optimal number of epochs:
<ul class="org-ul">
<li>increase the number of nodes in a layer</li>
<li>increase the number of layers in the network</li>
</ul></li>
<li>specify a model that clearly overfits the data</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgef75b21" class="outline-2">
<h2 id="orgef75b21">Treatment effects</h2>
<div class="outline-text-2" id="text-orgef75b21">
</div>
<div id="outline-container-orgd39b2b0" class="outline-3">
<h3 id="orgd39b2b0">IV</h3>
<div class="outline-text-3" id="text-orgd39b2b0">
</div>
<div id="outline-container-org7b7cd53" class="outline-4">
<h4 id="org7b7cd53">generating our data</h4>
<div class="outline-text-4" id="text-org7b7cd53">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/o5O2P8DrAZA" frameborder="0" allowfullscreen>generating our data</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>we generate data with no direct (causal) effect of education on wage</li>
<li>with an OLS estimation we find a positive and significant effect of education on the wage rate</li>
<li>hence OLS is not the correct estimator to find the causal effect of education on wage</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>define a function that generates the data, runs the OLS and returns the results as a function of the parameters <code>alpha_w, alpha_e, beta_ew, beta_qe</code>.</li>
<li>for different values of the parameters, see what the OLS result is; e.g. what happens to the OLS estimation of the effect of education on wage in case <code>alpha_ew</code> equals 1.0?</li>
</ul>
</div>
</div>

<div id="outline-container-orgaed99d1" class="outline-4">
<h4 id="orgaed99d1">IV estimate</h4>
<div class="outline-text-4" id="text-orgaed99d1">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/GjBvmgOB4TU" frameborder="0" allowfullscreen>IV estimate</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>using IV we correctly identify the causal effect of education on wage</li>
<li>the first stage correctly captures the effect of the instrument <code>q</code> on education</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>which properties of <code>q</code> make it a valid instrument?</li>
<li>generate data with <code>alpha_ew</code> equal to 1; can the IV estimation correctly identify this parameter?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2abf822" class="outline-3">
<h3 id="org2abf822">Heterogenous treatment effects</h3>
<div class="outline-text-3" id="text-org2abf822">
</div>
