org-files/pagescreencasts.org
*** generating our data

[[yt:CJbiwXSnAV8][generating data]]

Topics we cover in this video:
- use of =np.ones_like, np.zeros_like=
- using dictionaries to define effects and functions for different groups
- python can loop over a list of strings (names for the different subgroups)
- we avoid copy/paste of code for different groups by using dictionaries together with a function
  - if we change something, we only need to change it once in our code (i.e. not change it for each group which we would have to do if you copy/paste your code)
- with =np.concatenate= we "glue" the vectors for the groups together in columns for the dataframe

Questions you should be able to answer before continuing:
- generate another dataframe =df2= with different values for $\beta,\tau$ and/or $n$
- do the analyses below as well for this dataframe and compare results to the analysis with =df=

*** what can we calculate?

[[yt:s4MinmKxytw][comparing average earnings of individuals with and without traing]]

Topics we cover in this video:
- with heterogeneous effects, comparing expected earnings with and without training does not give us a straightforward training effect
  
Questions you should be able to answer before continuing:
- compare expected earnings of individuals with and without an invitation to the training. Does this identify the training effect? [hint: use =df[df.invited==1].earnings= etc.]
- do the same when comparing the group (trained and invited) with the group (not trained and not invited)

*** three cases where we can identify the treatment effect

[[yt:_GiHNAfhm4Y][three cases where we can identify treatment effects]]

Topics we cover in this video:
- three scenario's where we can recover the relevant treatment effect
- calculate a conditional probability with =np.sum= over a dataframe column
  
Questions you should be able to answer before continuing:
- why does the equation of Agrist and Pischke (2009) not work if there are always takers?

** Probability of treatment

*** generating our data

[[yt:KrTwMeWUCx0][generating data with probability of treatment]]

Topics we cover in this video:
- using dictionaries we generate a dataframe for different types
- we model a nudge where receiving an explicit invitation increases the probability that the training is finished successfully

  Questions you should be able to answer before continuing:
- calculate using the dataframe the effect of the invitation on the training probability; i.e. the mean of =trained= conditional on being invited minus this mean conditional on not being invited. Check that this is close to 0.4. 

*** effect of training on earnings

[[yt:Gk_lo-UG_tA][effect of training]]

Topics we cover in this video:
- using the dataframe we determine the effect of training on earnings without observing which individuals successfully finished their training
- we only observe who received a nudge by being explicitly invited to the training
  
Questions you should be able to answer before continuing:
- use =results_second_stage.params= to see what this returns exactly and what is selected by =params[1]=


* Part 2

For part 2 of the screencasts, go to [[./pagescreencasts2.org][this page]].


* template :noexport:

[[yt:][]

Topics we cover in this video:
- 

  
Questions you should be able to answer before continuing:
- 
