pagescreencasts.html
<div id="outline-container-org5f8b9c6" class="outline-4">
<h4 id="org5f8b9c6">generating our data</h4>
<div class="outline-text-4" id="text-org5f8b9c6">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/CJbiwXSnAV8" frameborder="0" allowfullscreen>generating data</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>use of <code>np.ones_like, np.zeros_like</code></li>
<li>using dictionaries to define effects and functions for different groups</li>
<li>python can loop over a list of strings (names for the different subgroups)</li>
<li>we avoid copy/paste of code for different groups by using dictionaries together with a function
<ul class="org-ul">
<li>if we change something, we only need to change it once in our code (i.e. not change it for each group which we would have to do if you copy/paste your code)</li>
</ul></li>
<li>with <code>np.concatenate</code> we "glue" the vectors for the groups together in columns for the dataframe</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>generate another dataframe <code>df2</code> with different values for \(\beta,\tau\) and/or \(n\)</li>
<li>do the analyses below as well for this dataframe and compare results to the analysis with <code>df</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgccb2b15" class="outline-4">
<h4 id="orgccb2b15">what can we calculate?</h4>
<div class="outline-text-4" id="text-orgccb2b15">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/s4MinmKxytw" frameborder="0" allowfullscreen>comparing average earnings of individuals with and without traing</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>with heterogeneous effects, comparing expected earnings with and without training does not give us a straightforward training effect</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>compare expected earnings of individuals with and without an invitation to the training. Does this identify the training effect? [hint: use <code>df[df.invited==1].earnings</code> etc.]</li>
<li>do the same when comparing the group (trained and invited) with the group (not trained and not invited)</li>
</ul>
</div>
</div>

<div id="outline-container-org605c950" class="outline-4">
<h4 id="org605c950">three cases where we can identify the treatment effect</h4>
<div class="outline-text-4" id="text-org605c950">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/_GiHNAfhm4Y" frameborder="0" allowfullscreen>three cases where we can identify treatment effects</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>three scenario's where we can recover the relevant treatment effect</li>
<li>calculate a conditional probability with <code>np.sum</code> over a dataframe column</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>why does the equation of Agrist and Pischke (2009) not work if there are always takers?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0cafaf6" class="outline-3">
<h3 id="org0cafaf6">Probability of treatment</h3>
<div class="outline-text-3" id="text-org0cafaf6">
</div>
<div id="outline-container-org55ef8b9" class="outline-4">
<h4 id="org55ef8b9">generating our data</h4>
<div class="outline-text-4" id="text-org55ef8b9">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/KrTwMeWUCx0" frameborder="0" allowfullscreen>generating data with probability of treatment</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>using dictionaries we generate a dataframe for different types</li>
<li><p>
we model a nudge where receiving an explicit invitation increases the probability that the training is finished successfully
</p>

<p>
Questions you should be able to answer before continuing:
</p></li>
<li>calculate using the dataframe the effect of the invitation on the training probability; i.e. the mean of <code>trained</code> conditional on being invited minus this mean conditional on not being invited. Check that this is close to 0.4.</li>
</ul>
</div>
</div>

<div id="outline-container-org0e6042c" class="outline-4">
<h4 id="org0e6042c">effect of training on earnings</h4>
<div class="outline-text-4" id="text-org0e6042c">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/Gk_lo-UG_tA" frameborder="0" allowfullscreen>effect of training</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>using the dataframe we determine the effect of training on earnings without observing which individuals successfully finished their training</li>
<li>we only observe who received a nudge by being explicitly invited to the training</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>use <code>results_second_stage.params</code> to see what this returns exactly and what is selected by <code>params[1]</code></li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-org94ebb02" class="outline-2">
<h2 id="org94ebb02">Part 2</h2>
<div class="outline-text-2" id="text-org94ebb02">
<p>
For part 2 of the screencasts, go to <a href="./pagescreencasts2.html">this page</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jan Boone</p>
</div>
</body>
</html>
